aiotcom/aiotcode/物联网综合应用实验台/传感器数据采集、传输及硬件控制基础实验/基于STM32模块实验/16.TFT屏模块实验程序/HARDWARE/TFT/TFT.h
#ifndef __TFT__H
#define __TFT__H

#include "stm32f7xx.h"
#include "stm32f7xx_hal.h"
#include "font.h"

#define u8 			uint8_t
#define u16 		uint16_t
#define u32 		uint32_t

/* touch panel interface define */
#define  CMD_RDX  0xD0	 //触摸IC读坐标积存器
#define  CMD_RDY  0x90

struct tp_pix_
{
	u16 x;
	u16 y;
};
struct tp_pixu32_
{
	u32 x;
	u32 y;
};

extern struct tp_pix_  tp_pixad,tp_pixlcd;	 	//当前触控坐标的AD值,前触控坐标的像素值

extern void Touch_Adjust(void);
u8 Read_TP_Once(void);
u8 Read_ADS2(u16 *x,u16 *y);
u8 Read_ADS(u16 *x,u16 *y);
u16 ADS_Read_XY(u8 xy);
u16 ADS_Read_AD(unsigned char CMD);
void Drow_Touch_Point(u16 x,u16 y);

#define LCD_REST_H 	HAL_GPIO_WritePin(GPIOA,GPIO_PIN_6,GPIO_PIN_SET)//GPIOA->BSRR = GPIO_PIN_6;	//
#define LCD_SDI_H  	HAL_GPIO_WritePin(GPIOA,GPIO_PIN_0,GPIO_PIN_SET)//GPIOA->BSRR = GPIO_PIN_0;	//
#define LCD_SCK_H  	HAL_GPIO_WritePin(GPIOA,GPIO_PIN_8,GPIO_PIN_SET)//GPIOA->BSRR = GPIO_PIN_8;	//
#define LCD_CS_H   	HAL_GPIO_WritePin(GPIOG,GPIO_PIN_12,GPIO_PIN_SET)//GPIOG->BSRR = GPIO_PIN_12;	//
#define LCD_DC_H   	HAL_GPIO_WritePin(GPIOG,GPIO_PIN_10,GPIO_PIN_SET)//GPIOG->BSRR = GPIO_PIN_10;	//

#define LCD_REST_L 	HAL_GPIO_WritePin(GPIOA,GPIO_PIN_6,GPIO_PIN_RESET)//GPIOA->BSRR = GPIO_PIN_6<<16;	//
#define LCD_SDI_L  	HAL_GPIO_WritePin(GPIOA,GPIO_PIN_0,GPIO_PIN_RESET)//GPIOA->BSRR = GPIO_PIN_0<<16;	//
#define LCD_SCK_L  	HAL_GPIO_WritePin(GPIOA,GPIO_PIN_8,GPIO_PIN_RESET)//GPIOA->BSRR = GPIO_PIN_8<<16;	//
#define LCD_CS_L   	HAL_GPIO_WritePin(GPIOG,GPIO_PIN_12,GPIO_PIN_RESET)//GPIOG->BSRR = GPIO_PIN_12<<16;	//
#define LCD_DC_L   	HAL_GPIO_WritePin(GPIOG,GPIO_PIN_10,GPIO_PIN_RESET)//GPIOG->BSRR = GPIO_PIN_10<<16;	//

#define T_CS_L   		HAL_GPIO_WritePin(GPIOA,GPIO_PIN_11,GPIO_PIN_RESET)//GPIOA->BSRR = GPIO_PIN_11<<16;	//
#define T_CS_H   		HAL_GPIO_WritePin(GPIOA,GPIO_PIN_11,GPIO_PIN_SET)//GPIOA->BSRR = GPIO_PIN_11;	//

#define T_OUT   		HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_3)

extern  u16 BACK_COLOR,POINT_COLOR;   	//背景色，画笔色

u16  LCD_ReadPoint(u16 x,u16 y); 				//读点
extern uint8_t touch_fig;								//接触完成标志位
extern uint32_t px,py;									//存放获取到的坐标信息		

void TFT_UI(void);											//风扇控制显示界面
void Key_Handler(void);									//触摸按键处理
void Lcd_Init(void); 
void LCD_Clear(u16 Color);
void Fan_Gears(uint8_t Gears);
void Address_set(unsigned int x1,unsigned int y1,unsigned int x2,unsigned int y2);
void Fan_Status_Display(u16 xsta,u16 ysta,u16 xend,u16 yend,u16 color,uint8_t Gears);
void LCD_WR_DATA8(char da);
void LCD_WR_DATA(int da);
void LCD_WR_REG(char da);
void TFT_Init(void);

void LCD_DrawPoint(u16 x,u16 y);		//画点
void LCD_DrawPoint_big(u16 x,u16 y);//画一个大点
void Draw_Circle(u16 x0,u16 y0,u8 r);
void LCD_DrawLine(u16 x1, u16 y1, u16 x2, u16 y2);
void LCD_DrawRectangle(u16 x1, u16 y1, u16 x2, u16 y2);		   
void LCD_Fill(u16 xsta,u16 ysta,u16 xend,u16 yend,u16 color);
void LCD_ShowChar(u16 x,u16 y,u8 num,u8 mode);			//显示一个字符
void LCD_ShowNum(u16 x,u16 y,u32 num,u8 len);				//显示数字
void LCD_Show2Num(u16 x,u16 y,u16 num,u8 len);			//显示2个数字
void LCD_ShowString(u16 x,u16 y,const u8 *p,u8 mode);//显示一个字符串,16字体
 
void showhanzi(unsigned int x,unsigned int y,unsigned char index);

 //定义LCD的尺寸	
#define LCD_W 240
#define LCD_H 320

//画笔颜色
#define WHITE         	 	0xFFFF
#define BLACK         	 	0x0000	  
#define BLUE         	 		0x001F  
#define BRED             	0XF81F
#define GRED 			 				0XFFE0
#define GBLUE			 				0X07FF
#define RED           	 	0xF800
#define MAGENTA       	 	0xF81F
#define GREEN         	 	0x07E0
#define CYAN          	 	0x7FFF
#define YELLOW        	 	0xFFE0
#define BROWN 			 			0XBC40 	//棕色
#define BRRED 			 			0XFC07 	//棕红色
#define GRAY  			 			0X8430 	//灰色
//GUI颜色

#define DARKBLUE      	 	0X01CF	//深蓝色
#define LIGHTBLUE      	 	0X7D7C	//浅蓝色  
#define GRAYBLUE       	 	0X5458 	//灰蓝色
//以上三色为PANEL的颜色 
 
#define LIGHTGREEN     		0X841F 	//浅绿色
#define LGRAY 			 			0XC618 	//浅灰色(PANNEL),窗体背景色

#define LGRAYBLUE        	0XA651 	//浅灰蓝色(中间层颜色)
#define LBBLUE           	0X2B12 	//浅棕蓝色(选择条目的反色)



#endif
